Classes/Junior Year/January 2019/Assignment 3/Task 4/TUT3/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices 
(
(0 0 0) //a
(2 0 0)
(2 1 0)
(0 1 0)
(0 0 1)
(2 0 1)
(2 1 1)
(0 1 1)
(1 1 0) //b
(3 1 0)
(3 2 0)
(1 2 0)
(1 1 1)
(3 1 1)
(3 2 1)
(1 2 1)


);

blocks 
(
hex (0 1 2 3 4 5 6 7) (10 4 4) simpleGrading (1 1 1) 
hex (8 9 10 11 12 13 14 15) (10 4 4) simpleGrading (1 1 1)

);

edges 
(
);

patches 
(
patch inlet 
(
(0 4 7 3)
(8 12 15 11)

)
patch outlet 
(
//(25 26 30 29)
//(33 34 38 37)

)
wall upper 
(
(11 15 14 10)
//(19 23 22 18)
//(27 31 30 26) 
)
wall lower 
(
(0 1 5 4)
(1 2 6 5)
//(16 17 21 20)
//(32 33 37 36)
//(32 36 39 35)

)
wall front 
(
(4 5 6 7)
(12 13 14 15)
//(20 21 22 23)
//(28 29 30 31)
//(36 37 38 39)
)
wall back 
(
(0 3 2 1)
(8 11 10 9)
//(16 19 18 17)
//(24 27 26 25)
//(32 35 34 33)
)

patch i1
(	
(3 7 6 2)
) 

patch i2
(
(8 9 13 12)
)

patch i3
(
(9 10 14 13) 
)

patch i4
(
//(16 20 23 19) 
)

patch i5
(
//(17 18 22 21) 
)

patch i6
(
//(24 28 31 27) 
)

patch i7
(
//(24 25 29 28)
)

patch i8
(
//(35 39 38 34)
)

);

mergePatchPairs
(
(i2 i1)
//(i3 i4)
//(i6 i5)
//(i7 i8)
);

// ************************************************** *********************** //